app/views/order_page/neworder.html.erb


<% array = Bento.all.map { |bento| [bento.item_name, bento.id] } %>
---
SELECT "bentos".* FROM "bentos"