app/controllers/bento_order_controller.rb

	def index
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@bentoOrders = BentoOrder.all
---
SELECT "bento_orders".* FROM "bento_orders"

	def create
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@bentoOrder = BentoOrder.new(boparam)
			@bentoOrder.save
---
INSERT INTO "bento_orders" ("orderDate", "totalPrice", "customer_id", "pretty_id", "payWay_id", "deliverTime_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def modify
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@bentoOrder = BentoOrder.find(params[:id])
---
SELECT  "bento_orders".* FROM "bento_orders" WHERE "bento_orders"."id" = $1 LIMIT 1  [["id", 1]]

	def updating
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@bentoOrder = BentoOrder.find(params[:id])
			@bentoOrder.update_attributes(boparam)
---
SELECT  "bento_orders".* FROM "bento_orders" WHERE "bento_orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "bento_orders" SET "customer_id" = $1, "pretty_id" = $2, "payWay_id" = $3, "updated_at" = $4 WHERE "bento_orders"."id" = $5  [["customer_id", 1], ["pretty_id", 1], ["payWay_id", 1], ["updated_at", "2016-01-06 14:45:03.735314"], ["id", 1]]

	def delete
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@bentoOrder = BentoOrder.find(params[:id])
			@bentoOrder.destroy
---
SELECT  "bento_orders".* FROM "bento_orders" WHERE "bento_orders"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "bento_orders" WHERE "bento_orders"."id" = $1  [["id", 1]]