app/controllers/bentoshop_controller.rb

	def index
		@bentoshops = Bentoshop.all
---
SELECT "bentoshops".* FROM "bentoshops"

	def create
		@bentoshop = Bentoshop.new(shop)
		@bentoshop.save
---
INSERT INTO "bentoshops" ("shop_name", "address", "phone", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["shop_name", "大水源"], ["address", "羅斯福路"], ["phone", "0982342814"], ["city", "taipei"], ["created_at", "2016-01-10 06:10:21.524620"], ["updated_at", "2016-01-10 06:10:21.524620"]]

	def modify
		@bentoshop = Bentoshop.find(params[:id])
---
SELECT  "bentoshops".* FROM "bentoshops" WHERE "bentoshops"."id" = $1 LIMIT 1  [["id", 2]]

	def updating
		@bentoshop = Bentoshop.find(params[:id])
		@bentoshop.update_attributes(shop)
---
SELECT  "bentoshops".* FROM "bentoshops" WHERE "bentoshops"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "bentoshops" SET "address" = $1, "updated_at" = $2 WHERE "bentoshops"."id" = $3  [["address", "羅斯福路四段111號"], ["updated_at", "2016-01-10 06:11:05.211013"], ["id", 2]]

	def delete
		@bentoshop = Bentoshop.find(params[:id])
		@bentoshop.destroy
---
SELECT  "bentoshops".* FROM "bentoshops" WHERE "bentoshops"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "bentos" WHERE "bentos"."bentoshop_id" = $1  [["bentoshop_id", 4]]
DELETE FROM "bentoshops" WHERE "bentoshops"."id" = $1  [["id", 2]]