app/controllers/bento_controller.rb

SELECT "bentos".* FROM "bentos"
---
	def index
		@bentos = Bento.all

INSERT INTO "bentos" ("item_name", "price", "bentoshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_name", "腿庫飯"], ["price", 80], ["bentoshop_id", 2], ["created_at", "2016-01-10 07:17:50.317884"], ["updated_at", "2016-01-10 07:17:50.317884"]]
---
	def create
		@bento = Bento.new(bentoparam)
		@bento.save

SELECT  "bentos".* FROM "bentos" WHERE "bentos"."id" = $1 LIMIT 1  [["id", 2]]
---
	def modify
		@bento = Bento.find(params[:id])

SELECT  "bentos".* FROM "bentos" WHERE "bentos"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "bentos" WHERE "bentos"."id" = $1  [["id", 2]]
---
	def delete
		@bento = Bento.find(params[:id])
		@bento.destroy