app/controllers/customer_controller.rb

INSERT INTO "customers" ("cname", "account", "password", "city", "address", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@customer = Customer.new(cusparam)
		@customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", nil]]
---
	def modify
		@customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "customers" SET "account" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["account", "test123"], ["updated_at", "2016-01-06 02:34:54.202230"], ["id", 2]]
---
	def updating
		@customer = Customer.find(params[:id])
		@customer.update_attributes(cusparam)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 2]]
---
	def delete
		@customer = Customer.find(params[:id])
		@customer.destroy