app/controllers/deliver_time_controller.rb

	def index
		@deliverTimes = DeliverTime.all
---
SELECT "deliver_times".* FROM "deliver_times"

	def create
		@deliverTime = DeliverTime.new(time)
		@deliverTime.save
---
INSERT INTO "deliver_times" ("deliverTime", "deliverExpense", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["deliverTime", "11:00 ~ 14:00"], ["deliverExpense", 100], ["created_at", "2016-01-10 06:55:36.568694"], ["updated_at", "2016-01-10 06:55:36.568694"]]

	def modify
		@deliverTime = DeliverTime.find(params[:id])
---
SELECT  "deliver_times".* FROM "deliver_times" WHERE "deliver_times"."id" = $1 LIMIT 1  [["id", 3]]

	def updating
		@deliverTime = DeliverTime.find(params[:id])
		@deliverTime.update_attributes(time)
---
SELECT  "deliver_times".* FROM "deliver_times" WHERE "deliver_times"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "deliver_times" SET "deliverTime" = $1, "updated_at" = $2 WHERE "deliver_times"."id" = $3  [["deliverTime", "17:00 ~ 20:00"], ["updated_at", "2016-01-10 06:56:26.850888"], ["id", 3]]

	def delete
		@deliverTime = DeliverTime.find(params[:id])
		@deliverTime.destroy
---
SELECT  "deliver_times".* FROM "deliver_times" WHERE "deliver_times"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "deliver_times" WHERE "deliver_times"."id" = $1  [["id", 3]]