app/controllers/main_page_controller.rb

	def login
		@c = Customer.new(cusparam)
		puts "aaaaaaaaaaaaaa#{@c.account}, #{@c.password}aaaaaaaaaaaaaa"
		@customer = Customer.where(account: @c.account, password: @c.password)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."account" = $1 AND "customers"."password" = $2 LIMIT 1  [["account", "test"], ["password", "aaaa"]]
SELECT COUNT(*) FROM "customers" WHERE "customers"."account" = $1 AND "customers"."password" = $2  [["account", "test"], ["password", "aaaa"]]