app/controllers/main_page_controller.rb

SELECT "customers".* FROM "customers"
---
	def index
		@customer = Customer.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", nil]]
---
	def login
		@customer = Customer.find(params[:cname, :password])