app/controllers/order_detail_controller.rb

	def index
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@details = OrderDetail.all
---
SELECT "order_details".* FROM "order_details"

	def create
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@detail = OrderDetail.new(orderdetail)
			@detail.save
---
INSERT INTO "order_details" ("order_id", "item_id", "num", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 1], ["item_id", 1], ["num", 34], ["created_at", "2016-01-10 07:45:35.601203"], ["updated_at", "2016-01-10 07:45:35.601203"]]

	def modify
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@detail = OrderDetail.find(params[:id])
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = $1 LIMIT 1  [["id", 1]]

	def updating
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@detail = OrderDetail.find(params[:id])
			@detail.update_attributes(orderdetail)
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "order_details" SET "num" = $1, "updated_at" = $2 WHERE "order_details"."id" = $3  [["num", 33], ["updated_at", "2016-01-10 07:45:41.144791"], ["id", 1]]

	def delete
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@detail = OrderDetail.find(params[:id])
			@detail.destroy
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "order_details" WHERE "order_details"."id" = $1  [["id", 1]]