app/controllers/pay_way_controller.rb

SELECT "pay_ways".* FROM "pay_ways"
---
	def index
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@pay_ways = PayWay.all

INSERT INTO "pay_ways" ("payWay", "fee", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["payWay", "credit card"], ["fee", 10], ["created_at", "2016-01-06 12:22:52.351182"], ["updated_at", "2016-01-06 12:22:52.351182"]]
---
	def create
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@pay_way = PayWay.new(pwparam)
			@pay_way.save

SELECT  "pay_ways".* FROM "pay_ways" WHERE "pay_ways"."id" = $1 LIMIT 1  [["id", 1]]
---
	def modify
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@pay_way = PayWay.find(params[:id])

SELECT  "pay_ways".* FROM "pay_ways" WHERE "pay_ways"."id" = $1 LIMIT 1  [["id", 1]]
---
	def updating
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@pay_way = PayWay.find(params[:id])

SELECT  "pay_ways".* FROM "pay_ways" WHERE "pay_ways"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "pay_ways" WHERE "pay_ways"."id" = $1  [["id", 1]]
---
	def delete
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@pay_way = PayWay.find(params[:id])
			@pay_way.destroy