app/controllers/pretty_controller.rb

	def index
		@pretties = Pretty.all
---
SELECT "pretties".* FROM "pretties"

	def create
		@pretty = Pretty.new(prettyparam)
		@pretty.save
---
INSERT INTO "pretties" ("name", "prettyStyle", "strength", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "newpretty"], ["prettyStyle", "cute"], ["strength", 0], ["city", "Taipei"], ["created_at", "2016-01-06 12:03:30.112208"], ["updated_at", "2016-01-06 12:03:30.112208"]]

	def modify
		@pretty = Pretty.find(params[:id])
---
SELECT  "pretties".* FROM "pretties" WHERE "pretties"."id" = $1 LIMIT 1  [["id", 1]]

	def delete
		@pretty = Pretty.find(params[:id])
		@pretty.destroy
---
SELECT  "pretties".* FROM "pretties" WHERE "pretties"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "pretties" WHERE "pretties"."id" = $1  [["id", 1]]