app/controllers/pretty_ordership_controller.rb

	def index
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@pos = PrettyOrdership.all
---
SELECT "pretty_orderships".* FROM "pretty_orderships"

	def create
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@po = PrettyOrdership.new(poparam)
			@po.save
---
INSERT INTO "pretty_orderships" ("order_id", "pretty_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 2], ["pretty_id", 1], ["created_at", "2016-01-06 14:58:58.668396"], ["updated_at", "2016-01-06 14:58:58.668396"]]

	def modify
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@po = PrettyOrdership.find(params[:id])
---
SELECT  "pretty_orderships".* FROM "pretty_orderships" WHERE "pretty_orderships"."id" = $1 LIMIT 1  [["id", 1]]

	def updating
		if cookies[:key]!="admin" then
			redirect_to("/")
		else
			@po = PrettyOrdership.find(params[:id])
---
SELECT  "pretty_orderships".* FROM "pretty_orderships" WHERE "pretty_orderships"."id" = $1 LIMIT 1  [["id", 1]]